{
  "ALPHA-TOCOPHEROL ACETATE": {
    "status": "ALLOWED",
    "description": "A fat-soluble vitamin, also known as Vitamin E, which is found in vegetable oils, egg yolk, nuts, etc."
  },
  "ACACIA GUM": {
    "status": "ALLOWED",
    "alternateNames": ["GUM ACACIA", "GUM ARABIC"],
    "description": "A gum from trees of the Acacia species, used as a texture modifying agent."
  },
  "ACTIVE BACTERIAL CULTURES": {
    "status": "CHECK LABEL",
    "description": "Lactic acid producing bacteria used in fermented dairy products e.g., yogurt. They are grown on different types of agar, and include Lactobacillus acidophilus, Lactobacillus bifidus and Streptococcus thermophilus. If made with barley, it is not gluten free. Check label."
  },
  "ADDITIVES": {
    "status": "ALLOWED",
    "description": "See APPENDIX."
  },
  "ADLAY": {
    "status": "ALLOWED",
    "alternateNames": ["JOB'S TEARS"],
    "description": "See JOB'S TEARS."
  },
  "AGAR": {
    "status": "ALLOWED",
    "alternateNames": ["AGAR AGAR"],
    "description": "A gelatinous extract from certain algae, used as a texture modifying agent."
  },
  "ALANT STARCH": {
    "status": "ALLOWED",
    "alternateNames": ["DHALIN"],
    "description": "See INULIN."
  },
  "ALE": {
    "status": "NOT ALLOWED",
    "alternateNames": ["BEER", "LAGER", "PORTER", "STOUT"],
    "description": "See BEER."
  },
  "ALFALFA SPROUTS": {
    "status": "ALLOWED",
    "description": "Sprouted seeds (Medicago sativa) of a member of the legume family."
  },
  "ALGIN": {
    "status": "ALLOWED",
    "alternateNames": ["ALGINIC ACID"],
    "description": "A gum obtained from a brown marine algae (Macrocystis pyrifera). Used as a texture modifying agent."
  },
  "AMARANTH": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A starchy seed of the Amaranthaceae family. Sold as seed, flour or cereal. May also refer to a red food color, which is allowed. Requires GF claim."
  },
  "ANNATTO": {
    "status": "ALLOWED",
    "description": "A yellowish to reddish-orange color obtained from the seed coating of the tree (Bixa orellanna). It is often used to color sausage casings, margarine, shortening, and cheese."
  },
  "ARROWROOT": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A starchy flour from the roots of a plant species (Maranta arundinacea) native to the West Indies."
  },
  "ARROWROOT BISCUIT": {
    "status": "NOT ALLOWED",
    "description": "Biscuits made with wheat flour and arrowroot flour."
  },
  "ARTIFICIAL FLAVOR": {
    "status": "ALLOWED",
    "description": "See FLAVOR."
  },
  "ASAFOETIDA": {
    "status": "CHECK LABEL",
    "description": "A perennial plant (Ferula assafoetida) used as a spice in South Asian cuisine. The most commonly available form is a seasoning blend of a fine powder containing 30% asafoetida, along with rice or wheat flour and gum arabic."
  },
  "ASCORBIC ACID": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as Vitamin C, naturally found in citrus fruits and other fruits and vegetables. It is used as a preservative in foods."
  },
  "ASPARTAME": {
    "status": "ALLOWED",
    "description": "An artificial sweetener about 200 times as sweet as sugar."
  },
"ATTA": {
    "status": "NOT ALLOWED",
    "description": "A whole meal fine textured flour made from a low gluten soft wheat (Triticum vulgari) used to make South Asian flatbread (also known as chapatti flour)."
  },
  "AUTOLYZED YEAST": {
    "status": "CHECK LABEL",
    "description": "See YEAST (AUTOLYZED)."
  },
  "BACON": {
    "status": "CHECK LABEL",
    "description": "A cut of meat taken from the sides, belly, or back of a pig, then cured, smoked, or both. While most brands of bacon are gluten free, but some contain wheat. Check label for gluten sources. Although rare, some brands may include an added wheat derivative in the seasoning."
  },
  "BACON BITS (REAL)": {
    "status": "CHECK LABEL",
    "description": "Small bits of cooked real bacon used as topping for salads and side dishes. While most brands of real bacon bits are gluten free, some contain wheat. Check label for gluten sources."
  },
  "BACON BITS (IMITATION)": {
    "status": "CHECK LABEL",
    "description": "Small bits of textured vegetable protein artificially flavored to resemble bacon. Used as topping for salads and side dishes. May contain wheat flour or hydrolyzed wheat protein which are not gluten free."
  },
  "BACTERIAL CULTURES": {
    "status": "CHECK LABEL",
    "description": "See ACTIVE BACTERIAL CULTURES."
  },
  "BAKING POWDER": {
    "status": "CHECK LABEL",
    "description": "A leavening agent usually made with cornstarch, which is gluten free. Although rare, some brands may include wheat starch, which is not gluten free."
  },
  "BAKING SODA": {
    "status": "ALLOWED",
    "description": "A leavening agent used in baked good recipes. Also known as sodium bicarbonate or bicarbonate of soda. Sodium bicarbonate, synthetically derived."
  },
  "BARLEY": {
    "status": "NOT ALLOWED",
    "description": "A cereal plant (Hordein vulgare) or (Hordein disticon). Its grain contains gluten."
  },
  "BARLEY FLOUR": {
    "status": "NOT ALLOWED",
    "description": ""
  },
  "BARLEY GRASS": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "The leaves of barley grass do not contain gluten but the seeds have gluten. Some barley grass products have been found to have significant gluten contamination. Look for a product that has been tested for gluten and is labelled \"gluten free.\""
  },
  "BARLEY MALT": {
    "status": "NOT ALLOWED",
    "description": "Barley grain which has been soaked, germinated, and dried."
  },
  "BARLEY MALT EXTRACT": {
    "status": "NOT ALLOWED",
    "description": "An extract of barley, used as a flavoring agent."
  },
  "BARLEY MALT FLAVORING": {
    "status": "NOT ALLOWED",
    "description": "An extract of barley, used as a flavoring agent."
  },
  "BARLEY MALT SYRUP": {
    "status": "NOT ALLOWED",
    "description": "See MALT SYRUP."
  },
  "BARLEY STARCH": {
    "status": "NOT ALLOWED",
    "description": "A starch extracted from barley flour; contains varying levels of gluten and is NOT ALLOWED."
  },
  "BEANS (DRY)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See LEGUMES."
  },
  "BEER": {
    "status": "NOT ALLOWED",
    "description": "Check for barley, rye and/or wheat-based alcoholic beverages. These beverages are made by the fermentation of germinated barley, rye and/ or wheat which are not gluten free."
  },
  "BEER (GLUTEN REMOVED)": {
    "status": "NOT ALLOWED",
    "description": ""
  },
"BEER_GLUTEN_FREE": {
    "status": "ALLOWED",
    "description": "Alcoholic beverage made from buckwheat, rice, millet, or sorghum, which are gluten free."
  },
  "BENGAL_GRAM": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See CHICKPEA.",
    "aliases": ["besan", "channa", "chickpea", "garbanzo beans", "gram"]
  },
  "BESAN": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See CHICKPEA.",
    "aliases": ["bengal gram", "channa", "chickpea", "garbanzo beans", "gram"]
  },
  "BETA_CAROTENE": {
    "status": "ALLOWED",
    "description": "A pigment that gives orange, yellow or red color to foods such as carrots, sweet potatoes and peaches. It is converted in the body into vitamin A and is used as a food additive or as a color agent in pharmaceutical products.",
    "aliases": ["carotene"]
  },
  "BICARBONATE_OF_SODA": {
    "status": "ALLOWED",
    "description": "See BAKING SODA."
  },
  "BIOTIN": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as vitamin B7, is naturally found in foods such as egg yolk, beef liver and yeast."
  },
  "BLUE_CHEESE": {
    "status": "ALLOWED",
    "description": "Blue cheese is a classification of cow's milk or goat's milk cheeses with green/bluish mould. Varieties include Stilton, Blue Shropshire, Blue Cheshire, Blue Wensleydale, Buton Blue, Blue Vinney, Danish Blue, Roquefort and Gorgonzola. P. Roqueforti cultures may be grown on either gluten free or gluten-containing media. Following fermentation, the spores are collected, and the medium is discarded. Cultures (or spores) are then diluted, based on manufacturer's specifications to 1:500,000 to 1:1,000,000 (where 1 unit is 1 g of P. Roqueforti culture). This is equivalent to 1 gram of mold in 10,000 liters of milk. Based on the latest, most sensitive scientifically validated RS Elisa (Sandwich and Competitive methods) tests, no gluten was detected in blue cheese samples tested by Health Canada."
  },
  "BRANDY": {
    "status": "ALLOWED",
    "description": "See DISTILLED ALCOHOLIC BEVERAGES."
  },
  "BREAD_SPROUTED_GLUTEN_CONTAINING_GRAINS": {
    "status": "NOT ALLOWED",
    "description": "Breads made from gluten-containing grains which have been left to sprout. While the germination process may partially breakdown the protein in the germ, it is not gluten-free bread."
  },
  "BREWERS_YEAST": {
    "status": "NOT ALLOWED",
    "description": "See YEAST (BREWER'S)."
  },
  "BUCKWHEAT": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A starchy seed of the plant family Polygonaceae, which includes rhubarb. It is sold as seed, flour, or cereal. Requires a GF claim."
  },
  "BUCKWHEAT_FLOUR": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Pure buckwheat flour is gluten free. However, some companies mix buckwheat flour with wheat flour, which is not gluten free. Requires a GF claim."
  },
  "BUCKWHEAT_GROATS": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "The kernel inside the shell of the buckwheat seed. Requires a GF claim."
  },
  "BUCKWHEAT_GROATS_KASHA": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Buckwheat groats which have been roasted. Requires a GF claim."
  },
  "BUCKWHEAT_PASTA": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See SOBA PASTA.",
    "aliases": ["soba pasta"]
  },
  "BULGUR_WHEAT": {
    "status": "NOT ALLOWED",
    "description": "Parboiled wheat which is then dried and cracked.",
    "aliases": ["burghul"]
  },
  "BURGHUL": {
    "status": "NOT ALLOWED",
    "description": "See BULGUR WHEAT.",
    "aliases": ["bulgur wheat"]
  },
"BURNT SUGAR (CARAMEL, CARMEL)": {
    "status": "ALLOWED",
    "description": "See CARAMEL."
  },
  "BUTTER": {
    "status": "ALLOWED",
    "description": "A dairy product obtained by churning the fat from milk until it solidifies."
  },
  "BUTTERMILK SOLIDS": {
    "status": "ALLOWED",
    "description": "Fermented milk solids."
  },
  "CAROB BEAN GUM (LOCUST BEAN GUM)": {
    "status": "ALLOWED",
    "description": "See LOCUST BEAN GUM."
  },
  "CAROTENE (BETA CAROTENE)": {
    "status": "ALLOWED",
    "description": "See BETA CAROTENE."
  },
  "CARRAGEENAN": {
    "status": "ALLOWED",
    "description": "A gum derived from an Irish Moss seaweed (Chondrus crispus), used as a texture modifying agent."
  },
  "CALCIUM (ACETATE, CARBONATE, CITRATE, FUMARATE, GLUCONATE)": {
    "status": "ALLOWED",
    "description": "Forms of calcium used in food supplements to prevent or treat calcium deficiencies."
  },
  "CALCIUM PANTOTHENATE": {
    "status": "ALLOWED",
    "description": "See PANTOTHENIC ACID."
  },
  "CALCIUM PHOSPHATE": {
    "status": "ALLOWED",
    "description": "See PHOSPHATE (CALCIUM)."
  },
  "CARAMEL (BURNT SUGAR, CARMEL)": {
    "status": "ALLOWED",
    "description": "A brown coloring made by heating sugar or glucose in the presence of acid or alkali, used for coloring foods and confections."
  },
  "CARAWAY": {
    "status": "ALLOWED",
    "description": "The dried ripe seed (Carum carvi) of a plant of the parsley family, used as a spice."
  },
  "CARBOXYMETHYLCELLULOSE (CELLULOSE GUM)": {
    "status": "ALLOWED",
    "description": "A derivative of cellulose, used as a texture modifying agent."
  },
  "CARMEL (BURNT SUGAR, CARAMEL)": {
    "status": "ALLOWED",
    "description": "See CARAMEL."
  },
  "CAROB BEAN (ST. JOHN ' S BREAD)": {
    "status": "ALLOWED",
    "description": "The pods of the carob tree (Ceratonia siliqua), which may be ground and used as a chocolate substitute."
  },
  "CASSAVA (MANIOC, TAPIOCA)": {
    "status": "ALLOWED",
    "description": "A starchy edible root of a tropical plant (Manihot utilissima), used as a texture modifying agent."
  },
  "CAYENNE PEPPER": {
    "status": "ALLOWED",
    "description": "A very hot, ground pepper (Capsicum frutescens L.)."
  },
  "CELLULOSE GUM (CARBOXYMETHYLCELLULOSE)": {
    "status": "ALLOWED",
    "description": "See CARBOXYMETHYL CELLULOSE."
  },
  "CHANNA (CHANA)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A type of chickpea grown in the East Indies, sold as peas or ground into flour. Purchase Channa flour GF whenever possible. See CHICKPEA."
  },
  "CHEESE (BLUE)": {
    "status": "ALLOWED",
    "description": "See BLUE CHEESE."
  },
  "CHEESE (BRIE, CAMEMBERT, CHEDDAR, COTTAGE, FETA, MOZZARELLA, PARMESAN, ROMANO, ETC.)": {
    "status": "ALLOWED",
    "description": "Made from milk curdled with rennet or lactic acid enzymes."
  },
  "CHEESE POWDER": {
    "status": "ALLOWED",
    "description": "A dry form of cheese. It may sometimes be spray-dried with maltodextrin or a whey powder carrier."
  },
"CHEWING GUM": {
    "status": "CHECK LABEL",
    "description": "Sweetened product made from gum base, softeners, flavorings, and colourings."
  },
  "CHICORY": {
    "status": "ALLOWED",
    "description": "The root of the plant (Cichorium intybus), which is roasted and ground. It can be used as a flavoring or substitute for coffee or a source of inulin (SEE INULIN)."
  },
  "CHICKPEA (BENGAL GRAM, BESAN, CHANNA, GARBANZO BEANS, GRAM)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A legume (Cicer areitunum) used whole or ground as flour. Purchase chickpea flour with a GF whenever possible."
  },
  "CHILI POWDER": {
    "status": "ALLOWED",
    "description": "A blend of spices of which the major ingredient is chili pepper. Other ingredients may include red pepper, paprika, onion, garlic, cumin, oregano, salt and sometimes other spices."
  },
  "CHILI SAUCE": {
    "status": "CHECK LABEL",
    "description": "A spicy sauce made from chili peppers and other ingredients. Most chili sauce products are gluten free. While rare, some chili sauce products may contain rice vinegar which uses wheat in the fermentation process and are not gluten-free. See RICE VINEGAR."
  },
  "CHOCOLATE": {
    "status": "CHECK LABEL",
    "description": "A product made from ground roasted cacao beans. The kernels of fermented and roasted cacao beans are ground into a paste called chocolate liquor, which may be hardened in molds to form baking (bitter) chocolate or combined with other ingredients to make semi-sweet or milk chocolate. Examples include baking chocolate, chocolate chips and chocolate wafers."
  },
  "CHOCOLATES AND CHOCOLATE BARS": {
    "status": "CHECK LABEL",
    "description": "Some chocolates and chocolate bars may contain wheat flour, wheat starch or barley malt or barley malt flavoring. Check the ingredient list."
  },
  "CHOLECALCIFEROL": {
    "status": "ALLOWED",
    "description": "Also known as Vitamin D3 and added to milk, margarine, and cereals."
  },
  "CIDER VINEGAR": {
    "status": "ALLOWED",
    "description": "See VINEGAR (CIDER)."
  },
  "CITRIC ACID": {
    "status": "ALLOWED",
    "description": "An organic acid made when yeast or bacterial ferment glucose or dextrose from corn, beet sugar, molasses and rarely wheat. The manufacturing process makes citric acid gluten free regardless of the source."
  },
  "COCOA POWDER": {
    "status": "ALLOWED",
    "description": "The roasted ground beans of the cacao tree which are pressed to reduce the cocoa butter (vegetable fat) content and then is made into a powder."
  },
  "COLOURS": {
    "status": "ALLOWED",
    "description": "Food colours including amaranth, annatto, beta-carotene, and tartrazine do not contain gluten. Some food colours, such as tartrazine, may cause a reaction in a few individuals which is unrelated to gluten."
  },
  "CONFECTIONER'S SUGAR (ICING SUGAR)": {
    "status": "ALLOWED",
    "description": "See ICING SUGAR."
  },
  "CORN (MAIZE)": {
    "status": "ALLOWED",
    "description": "A cereal (Zea mays) widely used in gluten-free diets. Sold as fresh vegetable, or dried and ground into flour, cornmeal, cornstarch, or grits (hominy). Corn flour and cornmeal are higher risk of gluten cross-contact and require a GF claim."
  },
  "CORN GLUTEN": {
    "status": "ALLOWED",
    "description": "The protein in corn, also known as zein prolamin. This prolamin does not have a toxic effect on the intestine of persons with celiac disease. It is therefore allowed in the gluten-free diet."
  },
  "CORNSTARCH": {
    "status": "ALLOWED",
    "description": "It is produced from the starchy endosperm of the corn kernel and is highly refined."
  },
  "COUSCOUS": {
    "status": "NOT ALLOWED",
    "description": "A dish prepared with coarsely ground durum wheat."
  },
  "CREAM OF TARTAR (TARTARIC ACID)": {
    "status": "ALLOWED",
    "description": "A powder (potassium bitartrate) that is used in baking powders as an acid adjusting agent."
  },
  "CURRY PASTE": {
    "status": "CHECK LABEL",
    "description": "A paste made from the slightly acid, jelly-like pulp of the tamarind pod, combined with a variety of spices. Some curry pastes contain wheat flour or wheat gluten."
  },
  "CURRY POWDER": {
    "status": "CHECK LABEL",
    "description": "A mixture of turmeric with spices that can include cardamom, cinnamon, cloves, coriander, cumin, and fenugreek, made pungent with mustard, chili, and pepper. Carefully read the label for any gluten-containing ingredients or flours which are not allowed."
  },
  "CYANOCOBALAMIN": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as Vitamin B12. It is naturally found in animal flesh or animal products (eggs, milk, etc.)."
  },
  "CYCLAMATE": {
    "status": "ALLOWED",
    "description": "An artificial sweetener that is 30-50 times as sweet as sugar."
  },
  "DASHEEN (EDDO, TARO)": {
    "status": "ALLOWED",
    "description": "See TARO."
  },
  "DEXTRIN": {
    "status": "CHECK LABEL",
    "description": "A slightly sweet polysaccharide obtained by heating a starch in the presence of small amounts of moisture and an acid. Dextrin is not commonly used in foods. It is almost always derived from any of the following gluten-free grains - corn, waxy maize, arrowroot, rice, tapioca. However, in the rare instance when it is made from wheat, dextrin is NOT ALLOWED."
  },
  "DEXTROSE": {
    "status": "ALLOWED",
    "description": "Glucose made by the hydrolysis of a variety of starches, including corn, potato or wheat, followed by purification and crystallization. The manufacturing process makes dextrose gluten free regardless of the source of starch."
  },
  "DHALIN (ALANT STARCH)": {
    "status": "ALLOWED",
    "description": "See INULIN."
  },
  "DIGLYCERIDE": {
    "status": "ALLOWED",
    "description": "An emulsifier derived from vegetable oils."
  },
  "DILL PICKLE": {
    "status": "ALLOWED",
    "description": "See PICKLES."
  },
  "DINKEL (DINKLE, FARRO, FARO, GERMAN WHEAT, SPELT)": {
    "status": "NOT ALLOWED",
    "description": "See SPELT."
  },
  "DISTILLED ALCOHOLIC BEVERAGES": {
    "status": "ALLOWED",
    "description": "Some examples include bourbon, brandy, gin, rye whiskey, scotch whiskey and vodka. Rum is distilled from sugar cane. Brandy is distilled from wine and bourbon is distilled from a grain mash including corn. Since the distillation process does not allow proteins to enter the final product, distilled alcohols are gluten free even if derived from a gluten-containing grain (e.g., rye whiskey)."
  },
  "DURUM WHEAT": {
    "status": "NOT ALLOWED",
    "description": "A hard wheat (Triticum durum), often used in pasta."
  },
  "ETHYL MALTOL (MALTOL)": {
    "status": "ALLOWED",
    "description": "See MALTOL."
  },
  "FARINA": {
    "status": "NOT ALLOWED",
    "description": "A flour, or meal, which can be fine or coarse, usually made from wheat and is not gluten free."
  },
  "EDDO (DASHEEN, TARO)": {
    "status": "ALLOWED",
    "description": "See TARO."
  },
  "EGG (LIQUID)": {
    "status": "ALLOWED",
    "description": "Egg mixture containing egg yolk, egg white and emulsifiers."
  },
  "EGG (DRIED OR POWDER)": {
    "status": "ALLOWED",
    "description": "A blend of dried whole eggs, non-fat dry milk, soybean oil and salt. Beta-carotene and silicone dioxide are gluten-free additives which are sometimes used to improve color and prevent caking."
  },
  "EGG (SUBSTITUTE)": {
    "status": "ALLOWED",
    "description": "Mixture of liquid egg white, corn oil, gluten-free vegetable gums, emulsifiers and vitamins."
  },
  "EINKORN (EIKORN)": {
    "status": "NOT ALLOWED",
    "description": "An ancient variety of wheat (Triticum monococcum)."
  },
  "EMMER": {
    "status": "NOT ALLOWED",
    "description": "An ancient variety of wheat (Triticum dicoccum)."
  },
  "EMULSIFIERS": {
    "status": "ALLOWED",
    "description": "Naturally derived compounds (such as lecithins, mono- and di-glycerides) used to improve the quality and processing of foods See LECITHIN and MONO/DIGLYCERIDES."
  },
  "ENRICHED FLOUR (ENRICHED WHITE FLOUR, FLOUR, WHITE FLOUR)": {
    "status": "NOT ALLOWED",
    "description": "See FLOUR."
  },
  "ERGOCALCIFEROL": {
    "status": "ALLOWED",
    "description": "Fat soluble vitamin, also known as Vitamin D2. Added to milk, margarine, and cereals."
  },
  "FARRO (DINKEL, DINKLE, FARO, GERMAN WHEAT, SPELT)": {
    "status": "NOT ALLOWED",
    "description": "See SPELT."
  },
  "FERROUS (FUMARATE, GLUCONATE, SUCCINATE, SULFATE)": {
    "status": "ALLOWED",
    "description": "Synthetic forms of the mineral iron. Used most commonly as a supplement to prevent or treat iron deficiency anemia."
  },
  "FLAVOUR (NATURAL AND ARTIFICIAL)": {
    "status": "ALLOWED",
    "description": "Gluten-containing grains are not commonly used in flavour preparations. The exceptions are hydrolyzed wheat protein and barley malt flavouring. Both of these flavour components must be identified as WHEAT or BARLEY on the label of all products in Canada."
  },
  "FLAX": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A shiny brown seed of the Linaceae family. Available as a whole seed or ground (flaxmeal, flax flour or ground). Flax is naturally gluten free. However, it may be grown on land where wheat, rye, or barley had previously been grown and harvested. It may also be transported and/or processed in a facility that handles gluten-containing grains. It is recommended to purchase flax seeds with a \"gluten-free\" claim."
  },
  "FLOUR SALT": {
    "status": "ALLOWED",
    "description": "Finely ground salt with an added anti-caking agent."
  },
"FLOUR": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "All flours are considered high-risk for cross-contact and require a gluten-free claim. \"Wheat flour\" can be called white flour, enriched flour or enriched white flour and is not allowed."
  },
  "FOLATE (FOLIC ACID, FOLACIN)": {
    "status": "ALLOWED",
    "description": "See FOLIC ACID."
  },
  "FOLIC ACID (FOLACIN, FOLATE)": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as vitamin B9, which is naturally found in leafy and dark green vegetables, as well as citrus fruits. Used to fortify wheat flour and other grain products or found in dietary supplements to prevent or treat folate deficiency as well as other medical conditions, like neural tube defects."
  },
  "FRUIT SUGAR (FRUCTOSE)": {
    "status": "ALLOWED",
    "description": "Crystallized sucrose is sometimes sold as fruit sugar."
  },
  "FU": {
    "status": "NOT ALLOWED",
    "description": "A dried gluten product derived from wheat, available in thin sheets or thick round cakes. Mixed into soups and vegetable dishes as a protein supplement in Asian cuisines."
  },
  "FOLACIN (FOLIC ACID, FOLATE)": {
    "status": "ALLOWED",
    "description": "See FOLIC ACID."
  },
  "FOOD ADDITIVE": {
    "status": "ALLOWED",
    "description": "A substance added to food to aid in processing - see APPENDIX."
  },
  "FOOD COLOURS": {
    "status": "ALLOWED",
    "description": "See COLOURS."
  },
  "FROSTING (ICING)": {
    "status": "CHECK LABEL",
    "description": "See ICING."
  },
  "FRUCTOSE (FRUIT SUGAR)": {
    "status": "ALLOWED",
    "description": "A simple sugar naturally found in most fruits. Fructose can be manufactured from sucrose (sugar; glucose bound to fructose) and used as a sweetener."
  },
  "FRUCTOSE SYRUP": {
    "status": "ALLOWED",
    "description": "A syrup made from fructose e.g., high fructose corn syrup."
  },
  "FRUIT JUICE CONCENTRATE": {
    "status": "ALLOWED",
    "description": "Fruit juice which is clarified, filtered, and concentrated through evaporation."
  },
  "GARBANZO BEANS (BENGAL GRAM, BESAN, CHANNA, CHICKPEA, GRAM)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See CHICKPEA. - pulses are high risk for gluten cross contact/contamination. Purchase with a GF claim whenever possible."
  },
  "GARLIC": {
    "status": "ALLOWED",
    "description": "The bulb of a perennial plant (Allium sativum) of the lily family, used for seasoning."
  },
  "GARLIC (POWDER OR SALT)": {
    "status": "ALLOWED",
    "description": "Dehydrated, crushed garlic, to which salt may be added."
  },
  "GELATIN": {
    "status": "ALLOWED",
    "description": "A protein obtained from animal skins and tissues, used as a texture modifying agent."
  },
  "GERMAN WHEAT (DINKEL, DINKLE, FARRO, FARO, SPELT)": {
    "status": "NOT ALLOWED",
    "description": "See SPELT."
  },
  "GIN": {
    "status": "ALLOWED",
    "description": "See DISTILLED ALCOHOLIC BEVERAGES."
  },
  "GLUCONO-DELTA LACTONE": {
    "status": "ALLOWED",
    "description": "Used as an acid adjusting agent in sausages, frankfurters, and some dessert mixes."
  },
  "GLUCOSE": {
    "status": "ALLOWED",
    "description": "A common simple sugar used as sweetener."
  },
"GLUCOSE SYRUPS": {
    "status": "ALLOWED",
    "description": "A purified concentrated water-soluble solution of sugars. Glucose syrups can be made from a variety of starches such as corn, potato or wheat. The manufacturing process renders glucose syrups gluten free regardless of the source of starch."
  },
  "GLUTEN": {
    "status": "NOT ALLOWED",
    "description": "A sticky protein which gives structure to baked products. Found in wheat, rye, barley, triticale, spelt, kamut and other related grains (einkorn, emmer, dinkle). Protein from corn is sometimes called corn gluten and is allowed."
  },
  "GLUTEN FLOUR": {
    "status": "NOT ALLOWED",
    "description": "Wheat flour from which part of the starch has been removed."
  },
  "GLUTINOUS (SWEET) RICE": {
    "status": "CHECK LABEL",
    "description": "See RICE (GLUTINOUS)."
  },
  "GUAIAC GUM": {
    "status": "ALLOWED",
    "description": "Natural resin from the tree (Guajacum officinale) and some related tropical trees. Used as a preservative or antioxidant in colas."
  },
  "GUAR GUM (GUARAN)": {
    "status": "ALLOWED",
    "description": "A gum extracted from (Cyamopsis tetragonoloba) plant, used as a texture modifying agent."
  },
  "GUARAN": {
    "status": "ALLOWED",
    "description": "See GUAR GUM."
  },
  "GUM ACACIA": {
    "status": "ALLOWED",
    "description": "See ACACIA GUM."
  },
  "GUM ARABIC": {
    "status": "ALLOWED",
    "description": "See ACACIA GUM."
  },
  "HAM": {
    "status": "CHECK LABEL",
    "description": "The cured leg of pork. It may be fresh, cured, or cured-and smoked. While most hams are gluten free, some hams may include glazes or ingredients that contain gluten. A few brands of honey ham or black forest ham were found to use glazes and ingredients containing wheat flour, wheat starch or soy sauce (containing wheat)."
  },
  "GLYCERINE (GLYCEROL)": {
    "status": "ALLOWED",
    "description": "A synthetically manufactured product from vegetable and animal oils and fats or by fermentation of glucose with yeast."
  },
  "GLYCEROL (GLYCERINE)": {
    "status": "ALLOWED",
    "description": "See GLYCERINE."
  },
  "GRAHAM FLOUR": {
    "status": "NOT ALLOWED",
    "description": "Wheat flour to which part of the bran and other parts of the wheat kernel have been added."
  },
  "GRAM (CHICKPEA, GARBANZO BEANS, BENGAL GRAM, BESAN)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See CHICKPEA. Pulses are high risk for cross-contact with gluten-containing grains. It is recommended to buy pulses labelled \"gluten-free\" whenever possible or visually inspect and sort to remove any gluten-containing grains."
  },
  "HEMP SEEDS": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Hemp seeds are naturally gluten free. However, they may have been grown on land where wheat, rye or barley have previously been grown and harvested. Also, hemp seeds may be transported with and/or processed in a facility that handles gluten-containing grains. It is recommended to purchase hemp seeds with a \"gluten-free\" claim."
  },
  "HOPS": {
    "status": "ALLOWED",
    "description": "The flowers of a plant of the hemp family, used to flavor malt liquors."
  },
  "HYDROGENATED VEGETABLE OIL": {
    "status": "ALLOWED",
    "description": "A modified oil from vegetable sources."
  },  
  "HYDROLYZED VEGETABLE PROTEIN": {
    "status": "CHECK LABEL",
    "aliases": ["HVP", "HYDROLYZED PLANT PROTEIN", "HPP"],
    "description": "A flavor enhancer produced by the hydrolysis of protein, usually from soy, corn, peanut or wheat flour. If it contains protein from wheat, it is not gluten free. This ingredient name is no longer acceptable on Canadian food labels."
  },
  "ICING": {
    "status": "CHECK LABEL",
    "aliases": ["FROSTING"],
    "description": "A mixture of sugar and other ingredients, used for decorating baked goods. May contain wheat flour or wheat starch. Check the ingredient list."
  },
  "ICING SUGAR": {
    "status": "ALLOWED",
    "aliases": ["CONFECTIONER'S SUGAR"],
    "description": "Finely ground granulated sugar that contains not more than 5% starch, which is almost always cornstarch."
  },
  "IMITATION FISH": {
    "status": "CHECK LABEL",
    "aliases": ["SURIMI"],
    "description": "See SURIMI."
  },
  "INULIN": {
    "status": "ALLOWED",
    "aliases": ["DHALIN", "ALANT STARCH"],
    "description": "Soluble polymer of fructose found in plant species such as chicory, artichoke, and leek. It is commercially manufactured from chicory root. Often used as a source of fiber or as a prebiotic in supplements and some foods."
  },
  "INVERT SUGAR": {
    "status": "ALLOWED",
    "description": "A mixture of simple sugars (fructose and glucose) made from sucrose."
  },
  "ISOMALT": {
    "status": "ALLOWED",
    "description": "Sugar replacer made from beet sugar."
  },
  "JOB'S TEARS": {
    "status": "ALLOWED",
    "aliases": ["ADLAY"],
    "description": "Wild grass (Coix lacryma-jobi), botanically related to maize. Used as a cereal dish in South Asia."
  },
  "KAMUT": {
    "status": "NOT ALLOWED",
    "aliases": ["KAMUT", "KAWMUT"],
    "description": "(Triticum turgidum), an ancient relative of durum wheat."
  },
  "KARAYA GUM": {
    "status": "ALLOWED",
    "description": "A gum from an Indian tree (Sterculia urens), used as a texture modifying agent."
  },
  "KASHA": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See BUCKWHEAT GROATS, KASHA. Requires GF claim."
  },
  "KELP": {
    "status": "ALLOWED",
    "description": "A large edible brown seaweed."
  },
  "KETCHUP": {
    "status": "ALLOWED",
    "description": "A condiment made from tomato paste, glucose-fructose/sugar, white vinegar, salt, and other spices."
  },
  "KOJI": {
    "status": "CHECK LABEL",
    "description": "A Japanese term for the mold officially known as Aspergillus Oryzae. When grown on rice, it creates rice koji (cultured rice), which is gluten free. However, koji culture (Aspergillus Oryzae) may also be grown on wheat or barley to produce soy sauce, miso sauce and other seasonings. In this case, the koji mixture is not gluten free."
  },
  "KONJAC FLOUR": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Flour derived from tubers of species (Amorphophallus konjac); eaten in Japan as firm jelly."
  },
  "KUDZU": {
    "status": "ALLOWED",
    "description": "A starchy extract from the root of a Japanese plant (Pueraria lobata), used as a thickener."
  },
  "LACTASE": {
    "status": "ALLOWED",
    "description": "Enzyme preparation, sold as drops or tablets, which helps breakdown lactose to glucose and galactose. May be useful in managing lactose intolerance."
  },
  "LACTOBACILLUS ACIDOPHILUS": {
    "status": "ALLOWED",
    "description": "See ACTIVE BACTERIAL CULTURES."
  },
  "LACTOBACILLUS BIFIDUS": {
    "status": "ALLOWED",
    "description": "See ACTIVE BACTERIAL CULTURES."
  },
  "LACTOSE": {
    "status": "ALLOWED",
    "description": "A sugar naturally present in milk. It is glucose bound to galactose and may not be tolerated by some individuals with celiac disease."
  },
  "LAGER": {
    "status": "NOT ALLOWED",
    "aliases": ["ALE", "BEER", "PORTER", "STOUT"],
    "description": "See BEER."
  },
  "LECITHIN": {
    "status": "ALLOWED",
    "description": "A substance primarily made from soybean oil, but may also come from corn and other vegetable seeds, egg yolk, and animal sources; used as a texture modifying agent."
  },
  "LEGUMES": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Seeds of plants of the family Leguminosae, which includes peanuts and a wide variety of dry peas, lentils and beans including channa, chickpeas (garbanzo beans, bengal gram, besan, gram), mung beans, lima beans, soybeans, urd, etc. Can be sold whole, as a flour or in pasta. Purchase with a GF claim whenever possible."
  },
  "LENTILS": {
    "status": "GLUTEN-FREE CLAIM",
    "aliases": ["BROWN", "RED", "GREEN"],
    "description": "A round, flat seed of a leguminous plant (Lens esculenta). Can be sold whole, split, as a flour, or in pasta. Lentils are high risk for gluten cross contact. It is recommended to buy lentils labelled 'gluten free' whenever possible. For lentils that are not labelled 'gluten free' do a visual inspection and remove any foreign grains. Rinse well before using."
  },
  "LICORICE": {
    "status": "CHECK LABEL",
    "description": "A sweet candy usually made with wheat flour, which is not gluten free. Some specialty brands of licorice do not contain gluten ingredients."
  },
  "LICORICE EXTRACT": {
    "status": "ALLOWED",
    "description": "Extract of licorice plant (Glycyrrhiza glabra), a leguminous plant."
  },
  "LIQUEURS": {
    "status": "CHECK LABEL",
    "description": "A mixture of distilled spirits with added flavoring substances or extracts."
  },
  "LOCUST BEAN GUM": {
    "status": "ALLOWED",
    "aliases": ["CAROB BEAN GUM"],
    "description": "A gum from a leguminous tropical tree (Ceratonia siliqua), used as a texture modifying agent."
  },
  "MAIZE": {
    "status": "ALLOWED",
    "aliases": ["CORN"],
    "description": "See CORN."
  },
  "MALT": {
    "status": "NOT ALLOWED",
    "aliases": ["BARLEY"],
    "description": "See BARLEY MALT."
  },
  "MALT (RICE)": {
    "status": "ALLOWED",
    "description": "See RICE MALT."
  },
  "MALT EXTRACT": {
    "status": "CHECK LABEL",
    "description": "Malt can be derived from various grains including corn, rice barley or wheat. It is not gluten free when made from barley or wheat."
  },
  "MALT FLAVORING": {
    "status": "CHECK LABEL",
    "description": "Malt can be derived from various grains including corn, rice wheat or barley. It is not gluten free if made from barley or wheat. See BARLEY MALT FLAVORING."
  },
  "MALT SUGAR": {
    "status": "ALLOWED",
    "description": "See MALTOSE."
  },
  "MALT SYRUP": {
    "status": "CHECK LABEL",
    "description": "A syrup derived from malt, used as a flavoring agent. Malt can be derived from various grains including corn, rice wheat or barley. It is not gluten free if made from barley or wheat."
  },
  "MALT VINEGAR": {
    "status": "CHECK LABEL",
    "description": "Malt can be derived from various grains including corn, rice wheat or barley. It is not gluten free if made from barley or wheat."
  },
  "MALTED MILK": {
    "status": "CHECK LABEL",
    "description": "A beverage prepared from milk and malted cereals, especially barley."
  },
  "MALTITOL": {
    "status": "ALLOWED",
    "aliases": ["MALTITOL SYRUP"],
    "description": "A sugar alcohol derived from corn syrup."
  },
  "MALTITOL SYRUP": {
    "status": "ALLOWED",
    "description": "See MALTITOL."
  },
  "MALTODEXTRIN": {
    "status": "ALLOWED",
    "description": "Product made from the hydrolysis of various starches such as corn, potato and rice. In North America, maltodextrins are almost always derived from corn and therefore, are gluten free. While rare, maltodextrin may be made from wheat. Using the most sensitive, scientifically validated RS Elisa tests, no gluten was detected in wheat-based maltodextrin."
  },
  "MALTOL": {
    "status": "ALLOWED",
    "aliases": ["ETHYL MALTOL"],
    "description": "A synthetic flavoring agent."
  },
  "MALTOSE": {
    "status": "ALLOWED",
    "description": "A sugar (glucose bound to glucose) made by enzymatic breakdown of starch (potato, rice, barley or wheat). Although barley or wheat may be used in the product of maltose, the manufacturing process makes maltose gluten free."
  },
  "MANIOC": {
    "status": "ALLOWED",
    "aliases": ["CASSAVA", "TAPIOCA"],
    "description": "See CASSAVA."
  },
  "MATZO": {
    "status": "NOT ALLOWED",
    "aliases": ["MATZOTH"],
    "description": "Unleavened bread or Passover bread made as thin, flat, round, or square biscuits eaten during the eight days of Passover in place of leavened bread. Most matzo is made from wheat flour and is not allowed. There are brands of gluten-free matzo."
  },
  "MATZO MEAL": {
    "status": "NOT ALLOWED",
    "description": "A mash made from matzo."
  },
  "MAYONNAISE": {
    "status": "ALLOWED",
    "description": "A product that is made of vegetable oil, egg yolks, lemon juice and vinegar."
  },
  "MAYONNAISE-TYPE DRESSINGS": {
    "status": "CHECK LABEL",
    "description": "A product that is made of vegetable oil, egg yolks, lemon juice and vinegar as well as any of the following ingredients: salt, sweetening agents, thickeners, and seasonings. Check the ingredient list for any sources of gluten."
  },
  "METHYLCELLULOSE": {
    "status": "ALLOWED",
    "description": "A derivative of cellulose used as a texture modified agent."
  },
  "MILLET": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A small seed of a cereal grain (Pennisetum glaucum) closely related to corn. Sold as whole seed or as a flour. Requires GF claim."
  },
  "MILO": {
    "status": "GLUTEN-FREE CLAIM",
    "aliases": ["SORGHUM"],
    "description": "See SORGHUM. Requires GF claim."
  },
  "MIRIN": {
    "status": "CHECK LABEL",
    "description": "A Japanese low-alcohol, sweet, golden-colored rice wine used to add sweetness and flavor to glazes, sauces, and variety of dishes. Some brands of imitation mirin cooking sauces use fermented wheat, which is not gluten free."
  },
  "MISO": {
    "status": "CHECK LABEL",
    "description": "A thick paste made from fermenting soybeans and a common grain such as wheat or barley, which is not gluten free. However, when rice is used, the miso product is gluten free."
  },
  "MODIFIED CORNSTARCH": {
    "status": "ALLOWED",
    "description": "Cornstarch that has been chemically modified to improve functional properties of foods."
  },
  "MODIFIED STARCH": {
    "status": "ALLOWED",
    "aliases": ["MODIFIED FOOD STARCH"],
    "description": "A starch that has been chemically modified to alter its physical characteristics. It is usually derived from corn, rice, potato or tapioca starch which are gluten free. This ingredient name is no longer acceptable on food labels in Canada."
  },
  "MOLASSES": {
    "status": "ALLOWED",
    "description": "A dark syrup left after crystallization of sugar from sugar cane."
  },
  "MONOGLYCERIDE": {
    "status": "ALLOWED",
    "description": "An emulsifier derived from vegetable oils."
  },
  "MONOSODIUM GLUTAMATE": {
    "status": "ALLOWED",
    "aliases": ["MSG"],
    "description": "A flavor enhancer produced through the fermentation of molasses primarily from sugar cane, corn, or beet sugar. Rarely wheat is used. However, MSG is the purified salt of glutamic acid and contains no residual protein after processing regardless of the source"
  },
  "MUSTARD": {
    "status": "CHECK LABEL",
    "aliases": ["PREPARED"],
    "description": "There are many varieties of mustards available on the market. Most consist of distilled vinegar, water, mustard seed, turmeric, salt, paprika, spices, natural flavor, garlic powder and are gluten free. However, some specialty mustard preparations may contain wheat flour, which is not gluten free. Check the ingredient list."
  },
  "MUSTARD BRAN": {
    "status": "ALLOWED",
    "description": "The outer layer of mustard seed which is removed during milling."
  },
  "MUSTARD POWDER": {
    "status": "CHECK LABEL",
    "description": "A powder made from pure ground mustard seed."
  },
  "MUSTARD POWDER (PREPARED)": {
    "status": "CHECK LABEL",
    "description": "A powder made of ground mustard seed, sugar, salt and spices. May also contain wheat flour or wheat starch, which are not gluten free."
  },
  "MUSTARD PICKLES": {
    "status": "CHECK LABEL",
    "description": "Cucumbers pickled in water, vinegar, mustard spices and seasonings to which wheat flour and/or malt vinegar may be added."
  },
  "NIACINAMIDE": {
    "status": "ALLOWED",
    "aliases": ["NIACIN"],
    "description": "A water-soluble compound, also known as vitamin B3. It is naturally found in dairy products, lean meats, nuts and eggs. Used in dietary supplements to prevent or treat niacin deficiency called pellagra."
  },
  "NON-DAIRY CREAMERS": {
    "status": "ALLOWED",
    "description": "Powder or liquid product containing sugar, corn syrup solids, partially hydrogenated vegetable oils; used as a substitute for dairy-based creamers."
  },
  "NORI": {
    "status": "ALLOWED",
    "description": "A type of seaweed of the genus Porphyra. See SEAWEED."
  },
  "NUTRITIONAL YEAST": {
    "status": "ALLOWED",
    "description": "See YEAST (NUTRITIONAL)."
  },
  "NUTS (PLAIN OR SALTED)": {
    "status": "ALLOWED",
    "description": "Almonds, brazil nuts, cashews, hazelnut (filberts), macadamia, pine (pignolia), pistachios or walnuts, as well as peanuts (a legume)."
  },
  "NUTS (DRY ROASTED OR SEASONED)": {
    "status": "CHECK LABEL",
    "description": "May be prepared with seasoning mixture containing wheat flour or wheat starch, which are not gluten free."
  },
  "NUTS (CORN OR SOY) PLAIN OR SALTED": {
    "status": "ALLOWED",
    "description": "Snack food made from corn or soy and vegetable oil."
  },
  "NUTS (CORN OR SOY) SEASONED": {
    "status": "CHECK LABEL",
    "description": "May be prepared with seasoning mixture containing wheat flour or wheat starch, which are not gluten free."
  },
  "NUT BEVERAGE (ALMOND, HAZELNUT)": {
    "status": "ALLOWED",
    "description": "A beverage made from water, evaporated cane juice, ground almonds or hazelnuts and flavorings. Used as a substitute for cow's milk."
  },
  "OATS (COMMERCIAL) (Not labelled gluten free)": {
    "status": "NOT ALLOWED",
    "description": "A cereal (Avena sativa) plant of the grass family. Research has revealed regular oat products have high gluten levels due to cross-contact with gluten-containing grains during seeding, harvest, storage, transportation, processing and/or packaging."
  },
  "OATS (PURE, UNCONTAMINATED LABELLED 'GLUTEN FREE')": {
    "status": "ALLOWED",
    "description": "Clinical studies have shown that pure, uncontaminated oats are safe for most adults and children with celiac disease. Health Canada has also done extensive reviews of the studies on safety of oats in celiac disease. They conclude that the vast majority of those with celiac disease can safely consume specially processed 'gluten-free' oats. Individuals with celiac disease who wish to add oats or oat products to their diet must ensure that the oats they are eating have a 'gluten-free' claim."
  },
  "OAT GUM": {
    "status": "NOT ALLOWED",
    "description": "A gum from the oat grain, used as a texture modifying agent."
  },
  "OAT MILK": {
    "status": "CHECK LABEL",
    "description": "If made with gluten-free oats they are allowed. Avoid products with regular oats."
  },
  "ONION (POWDER OR SALT)": {
    "status": "ALLOWED",
    "description": "Dried or freeze-dried product made from onions which are dehydrated, ground and salt may be added."
  },
  "ORZO": {
    "status": "NOT ALLOWED",
    "description": "Orzo is the Italian name for barley and used to describe rice shaped pasta. It is made in North America from semolina (wheat) flour."
  },
  "PALM KERNEL OIL": {
    "status": "ALLOWED",
    "description": "An oil derived from the seeds (kernels) of palm tree fruit."
  },
  "PANTOTHENIC ACID": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as vitamin B5. Naturally found in eggs, fish and milk and whole grain products."
  },
  "PAPRIKA": {
    "status": "ALLOWED",
    "description": "A spice made from ground pods of a sweet red pepper (Capsicum annum). Used for seasoning."
  },
  "PASTA": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "Usually made from durum wheat, kamut or spelt flours, which are not gluten free and are not allowed. Pasta made from beans, corn, lentils, potato, pure buckwheat, quinoa, soy or wild rice are allowed with a gluten-free label."
  },
  "PEANUTS (PLAIN OR SALTED)": {
    "status": "ALLOWED",
    "description": "Seeds of plants of the family Leguminosae."
  },
  "PEANUTS (DRY ROASTED OR SEASONED)": {
    "status": "CHECK LABEL",
    "description": "Seeds of plants of the family Leguminosae. May be prepared with a seasoning mixture containing wheat flour or wheat starch, which are not gluten free."
  },
  "PEAS (DRIED - WHOLE, SPLIT)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "See LEGUMES. Purchase with a GF claim whenever possible."
  },
  "PEAS (GREEN)": {
    "status": "ALLOWED",
    "description": "See LEGUMES, Sold as a fresh, frozen or canned vegetable."
  },
  "PEPPER (BLACK OR WHITE)": {
    "status": "ALLOWED",
    "description": "A mature berry of a tropical shrub (Piper nigrum). It is sold as whole or ground."
  },
  "PHOSPHATE (CALCIUM)": {
    "status": "ALLOWED",
    "description": "A white crystalline powder used in baking powders, toothpastes and added to food or sold as a dietary supplement."
  },
  "PICKLE": {
    "status": "ALLOWED",
    "description": "Vegetables, like cucumbers, beets, etc., marinated in water, white vinegar, sugar, spices, and seasonings."
  },
  "PICKLES (MUSTARD)": {
    "status": "CHECK LABEL",
    "description": "See MUSTARD PICKLES."
  },
  "PLAYDOUGH": {
    "status": "NOT ALLOWED",
    "description": "Craft dough made from water, salt and wheat flour. Some brands of children’s playdough contains wheat. Some similar gluten-free products are commercially available."
  },
  "POI": {
    "status": "ALLOWED",
    "description": "A Polynesian dish made by mashing taro root with water."
  },
  "PORT": {
    "status": "ALLOWED",
    "description": "A wine fortified with distilled alcohol and sugar."
  },
  "PORTER (ALE, BEER, LAGER)": {
    "status": "NOT ALLOWED",
    "description": "See BEER."
  },
  "POTATO": {
    "status": "ALLOWED",
    "description": "A starchy tuber, also sold as fresh vegetable, flour, starch or in a pasta. Potato flour requires a gluten-free claim."
  },
  "PSYLLIUM": {
    "status": "ALLOWED",
    "description": "A seed (Plantago psyllium) of the plantain family, used as a dietary bulking agent."
  },
  "PYRIDOXINE": {
    "status": "ALLOWED",
    "description": "A water-soluble vitamin, also known as vitamin B6. Naturally found in lean meats, fish, beans and whole grains."
  },
  "QUINOA (pronounced keen-wa)": {
    "status": "GLUTEN-FREE CLAIM",
    "description": "A small seed from a South American plant of the pigweed family Chenopodiaceae. Sold as a seed, flour, flakes, or in pasta (often combined with corn or rice flours). Requires a GF claim."
  },
  "RENNET": {
    "status": "ALLOWED",
    "description": "A milk coagulant that is the concentrated extract of rennin enzyme obtained from animal sources. It may also be produced through fungal fermentation."
  },
  "RIBOFLAVIN": {
    "status": "ALLOWED",
    "description": "Water-soluble vitamin, also known as Vitamin B2. Naturally found in lean meats, eggs, legumes, and green leafy vegetables."
  },
  "RICE (BLACK, BROWN, WHITE)": {
    "status": "ALLOWED",
    "description": "A cereal grain (Oryza sativa) of the grass family Graminae. Sold as a grain, flour, flakes, ground, or in pasta. Rice flour requires a gluten-free claim."
  }
}